app/Views/front-end/v_kategoriberita.php

                 <?php
                    foreach ($kategori as $key => $value) {
                        $db = \Config\Database::connect();
                        $user = $db->table('tbl_user')
                            ->where('id_user', $value['id_user'])
                            ->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `id_user` = '1'