app/Controllers/Home.php

SELECT *
FROM `tbl_guru`
 LIMIT 12, 12
SELECT COUNT(*) AS `numrows`
FROM `tbl_guru`
---
    public function Guru()
    {
        $data = [
            'judul' => 'Daftar Guru',
            'subjudul' => '',
            'page' => 'front-end/v_guru',
            'kategoriBerita' => $this->ModelBerita->Kategori(),
            'guru' => $this->ModelGuru->paginate(12, 'guru'),
            'pager' => $this->ModelGuru->pager,

        ];