app/Models/ModelBerita.php

    public function AllData()
    {
        return $this->db->table('tbl_berita')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_berita`

    public function InsertData($data)
    {
        $this->db->table('tbl_berita')->insert($data);
---
INSERT INTO `tbl_berita` (`judul_berita`, `slug_berita`, `kategori`, `isi_berita`, `id_user`, `tgl_berita`, `jam_berita`, `gambar`) VALUES ('juara 1 fashion show', 'juara-1-fashion-show', 'Prestasi', '<p>dsfsdffddf<br></p>', '1', '23-08-17', '06:35:03', '1692228903_7ba599a8a47c2c8e8f5f.jpg')

    public function UpdateData($data)
    {
        $this->db->table('tbl_berita')
            ->where(['id_berita' => $data['id_berita']])
            ->update($data);
---
UPDATE `tbl_berita` SET `id_berita` = '8', `isi_berita` = '<p>fdgfgdf<br></p>', `kategori` = 'berita', `id_user` = '1', `gambar` = '1672274777_70df1c022a5cac0fae0b.png'
WHERE `id_berita` = '8'