app/Models/ModelBerita.php

SELECT *
FROM `tbl_berita`
LEFT JOIN `tbl_kategoriBerita` ON `tbl_kategoriBerita`.`id_kategoriBerita`=`tbl_berita`.`id_kategoriBerita`
ORDER BY `id_berita` ASC
---
    public function AllData()
    {
        return $this->db->table('tbl_berita')
            ->join('tbl_kategoriBerita', 'tbl_kategoriBerita.id_kategoriBerita=tbl_berita.id_kategoriBerita', 'LEFT')
            ->orderBy('id_berita', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `tbl_kategoriberita`
ORDER BY `id_kategoriberita` DESC
---
    public function Kategori()
    {
        return $this->db->table('tbl_kategoriberita')
            ->orderBy('id_kategoriberita', 'desc')
            ->get()->getResultArray();

SELECT *
FROM `tbl_berita`
ORDER BY `id_berita` DESC
 LIMIT 5
---
    public function AllDataLimit()
    {
        return $this->db->table('tbl_berita')
            ->orderBy('id_berita', 'DESC')
            ->get(5)->getResultArray();

SELECT *
FROM `tbl_berita`
WHERE `id_kategoriBerita` = 2
ORDER BY `id_berita` DESC
 LIMIT 5
---
    public function AllDataPrestasi()
    {
        return $this->db->table('tbl_berita')
            ->limit(5)->orderBy('id_berita', 'DESC')
            ->where(['id_kategoriBerita' => 2])
            ->get()->getResultArray();

SELECT *
FROM `tbl_berita`
WHERE `id_kategoriBerita` = 1
ORDER BY `id_berita` DESC
 LIMIT 1
---
    public function AllDataPengumuman()
    {
        return $this->db->table('tbl_berita')
            ->limit(1)->orderBy('id_berita', 'DESC')
            ->where(['id_kategoriBerita' => 1])
            ->get()->getResultArray();

SELECT *
FROM `tbl_berita`
WHERE `id_kategoriBerita` = 3
ORDER BY `id_berita` DESC
 LIMIT 3
---
    public function AllDataKegiatan()
    {
        return $this->db->table('tbl_berita')
            ->limit(3)->orderBy('id_berita', 'DESC')
            ->where(['id_kategoriBerita' => 3])
            ->get()->getResultArray();

SELECT *
FROM `tbl_berita`
ORDER BY `id_berita` DESC
 LIMIT 1
---
    public function DataLimit()
    {
        return $this->db->table('tbl_berita')
            ->limit(1)->orderBy('id_berita', 'DESC')
            ->get()->getResultArray();