app/Models/ModelBerita.php

SELECT *
FROM `tbl_kategoriberita`
---
    public function Kategori()
    {
        return $this->db->table('tbl_kategoriberita')
            ->get()->getResultArray();