app/Models/ModelSekolah.php

SELECT *
FROM `tbl_sekolah`
WHERE `id_sekolah` = 1
---
    public function DetailData()
    {
        return $this->db->table('tbl_sekolah')
            ->where('id_sekolah', 1)
            ->get()->getRowArray();