app/Models/ModelJurusan.php

    public function DetailData($id_jurusan)
    {
        return $this->db->table('tbl_jurusan')
            ->where(['id_jurusan' => $id_jurusan])
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_jurusan`
WHERE `id_jurusan` = '1'