app/Models/ModelGuru.php

    public function AllData()
    {
        return $this->db->table('tbl_guru')
            ->orderBy('id_guru', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_guru`
ORDER BY `id_guru` ASC