app/Models/ModelGaleri.php

SELECT *
FROM `tbl_galeri`
---
    public function AllData()
    {
        return $this->db->table('tbl_galeri')
            ->get()->getResultArray();