app/Models/ModelSlider.php

SELECT *
FROM `tbl_slider`
---
    public function AllData()
    {
        return $this->db->table('tbl_slider')
            ->get()->getResultArray();