app/Views/template_admin.php

SELECT *
FROM `tbl_sekolah`
WHERE `id_sekolah` = 1
---
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <?php $db = \Config\Database::connect();
    $head = $db->table('tbl_sekolah')->where('id_sekolah', 1)->get()->getRowArray(); ?>