app/Views/template_front_end.php

SELECT *
FROM `tbl_sekolah`
WHERE `id_sekolah` = 1
---

<head>
    <?php $db = \Config\Database::connect();
    $head = $db->table('tbl_sekolah')->where('id_sekolah', 1)->get()->getRowArray(); ?>

SELECT *
FROM `tbl_sekolah`
WHERE `id_sekolah` = 1
SELECT *
FROM `tbl_jurusan`
WHERE `id_jurusan` <>0
---
<body>
    <?php
    $db = \Config\Database::connect();
    $web = $db->table('tbl_sekolah')->where('id_sekolah', 1)->get()
        ->getRowArray();

    $jurusan = $db->table('tbl_jurusan')
        ->where('id_jurusan<>0')->get()
        ->getResultArray();