app/Views/v_home.php

SELECT *
FROM `tbl_user`
WHERE `id_user` = '1'
---
             <?php
                foreach ($berita as $key => $value) {
                    $db = \Config\Database::connect();
                    $user = $db->table('tbl_user')
                        ->where('id_user', $value['id_user'])
                        ->get()->getRowArray();